In [ ]:
#Pandas Exercises

In [2]:
#Import the library
import pandas as pd

In [64]:
#Create a dictionary to work with
dict1 ={'Name':['Paulo','Carolina','Luisa','Vinicius','Gustavo',
                'Priscila','Mariana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

       Name  Marks  Gender
0     Paulo     98    Male
1  Carolina     89  Female
2     Luisa     99  Female
3  Vinicius     87    Male
4   Gustavo     90    Male
5  Priscila     83  Female
6   Mariana     99  Female

In [65]:
#To return the 3 firts rows
df1.head(3)

       Name  Marks  Gender
0     Paulo     98    Male
1  Carolina     89  Female
2     Luisa     99  Female

In [66]:
##To return the 3 final rows
df1.tail(3)

       Name  Marks  Gender
4   Gustavo     90    Male
5  Priscila     83  Female
6   Mariana     99  Female

In [67]:
#To show how many columns and rows the dataframe has
df1.shape

(7, 3)

In [68]:
#Print it
print("Number of rows: " , df1.shape[0], "and", "number os columns: ", df1.shape[1], ".")

Number of rows:  7 and number os columns:  3 .

In [69]:
#It shows information about de DF
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [70]:
#Find null values on the DF
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [71]:
#Sum the nulll values on the DF
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [72]:
#Shows the null values by column
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [73]:
#Shows the null values by row
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [74]:
#Gives statistical information
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [75]:
#Gives more especific statistical information
df1.describe(include = 'all')

         Name      Marks  Gender
count       7   7.000000       7
unique      7        NaN       2
top     Paulo        NaN  Female
freq        1        NaN       4
mean      NaN  92.142857     NaN
std       NaN   6.491753     NaN
min       NaN  83.000000     NaN
25%       NaN  88.000000     NaN
50%       NaN  90.000000     NaN
75%       NaN  98.500000     NaN
max       NaN  99.000000     NaN

In [76]:
#Gives statistical information with round numbers
df1.describe().round()

       Marks
count    7.0
mean    92.0
std      6.0
min     83.0
25%     88.0
50%     90.0
75%     98.0
max     99.0

In [77]:
#Only gives unique Gender values
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [78]:
#Gives how many genders the dataframe has
df1['Gender'].nunique()

2

In [79]:
#Counts how many people by gender the DF has
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [80]:
#Find Marks great equal 90
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [81]:
#Inserts the result above on a dataframe
df1[df1['Marks']>=90]

      Name  Marks  Gender
0    Paulo     98    Male
2    Luisa     99  Female
4  Gustavo     90    Male
6  Mariana     99  Female

In [82]:
#Use the .between to find values and insert them on a DF
df1[df1['Marks'].between(90, 100)]

      Name  Marks  Gender
0    Paulo     98    Male
2    Luisa     99  Female
4  Gustavo     90    Male
6  Mariana     99  Female

In [83]:
#Group the values between 90 and 100 using the sum function
sum(df1['Marks'].between(90, 100))

4

In [84]:
#Shows values between 90 and 100 using the & and using the |
df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)]

      Name  Marks  Gender
0    Paulo     98    Male
2    Luisa     99  Female
4  Gustavo     90    Male
6  Mariana     99  Female

In [85]:
(df1['Marks']>=90)  |  (df1['Marks']<=100)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
Name: Marks, dtype: bool

In [86]:
#Uses len to return how many marks exists between 90 and 100
len(df1[(df1['Marks']>=90)  &  (df1['Marks']<=100)])

4

In [87]:
#Uses mean to get the average of the Marks and use .round to get round numbers
df1['Marks'].mean().round()

92.0

In [88]:
#Creates a function for an operation
def marks(x):
    return x/2
#return x//2 will result in integer results

In [89]:
# .apply to use the function created above
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [90]:
#Create a new column named Half_marks
df1['Half_marks'] = df1['Marks'].apply(marks)

In [91]:
#print the df1
df1['Half_marks']

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Half_marks, dtype: float64

In [92]:
#Instead of creating a function you can use:
df1['Marks'].apply(lambda x: x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [93]:
#How many letters are contained in those names
df1['Name'].apply(len)

0    5
1    8
2    5
3    8
4    7
5    8
6    7
Name: Name, dtype: int64

In [94]:
# The .map() works similarly to the .apply() method, but it can be used to apply functions to each individual element of a column, 
# while the .apply() method is more suitable for applying functions to each row or column of the DataFrame.

In [95]:
#Creates a column called Male_Female and number it with 1 for male and 0 for female
df1['Male_Female'] = df1['Gender'].map({'Male':1, 'Female': 0})

In [96]:
#Exclude a especific column (Male_Female and Half_Marks)
#Specifying the axis parameter is necessary to ensure that the drop() method operates on the correct axis of the data
#To remove from the original DF you must use the inplace
df1.drop(['Male_Female', 'Half_marks'], axis = 1, inplace = True)

In [97]:
 df1

       Name  Marks  Gender
0     Paulo     98    Male
1  Carolina     89  Female
2     Luisa     99  Female
3  Vinicius     87    Male
4   Gustavo     90    Male
5  Priscila     83  Female
6   Mariana     99  Female

In [98]:
#Print the name of the columns
print(df1.columns)
#or
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [99]:
#index is an attribute that represents the labels of the rows of a DataFrame or a Series
df1.index

RangeIndex(start=0, stop=7, step=1)

In [100]:
#the output step = 1 means the increment

In [101]:
#sort the DF, the asc=false to order by the highest mark
df1.sort_values(by='Marks', ascending=False)

       Name  Marks  Gender
2     Luisa     99  Female
6   Mariana     99  Female
0     Paulo     98    Male
4   Gustavo     90    Male
1  Carolina     89  Female
3  Vinicius     87    Male
5  Priscila     83  Female

In [102]:
#Shows the name by a specific gender and shows only the name and marks columns
df1[df1['Gender']=='Female'] [['Name', 'Marks']]

       Name  Marks
1  Carolina     89
2     Luisa     99
5  Priscila     83
6   Mariana     99

In [103]:
#shows every column
df1[df1['Gender']=='Female']

       Name  Marks  Gender
1  Carolina     89  Female
2     Luisa     99  Female
5  Priscila     83  Female
6   Mariana     99  Female

In [104]:
# The .isin() method is used to check whether each element in a DataFrame or a Series is contained in a sequence of values provided 
# as an argument to the method. It returns a Boolean Series.
df1[df1['Gender'].isin(['Female'])]

       Name  Marks  Gender
1  Carolina     89  Female
2     Luisa     99  Female
5  Priscila     83  Female
6   Mariana     99  Female